{
  "main": {
    "name":"Josh Agins",
    "occupation":"Full-Stack Web Developer",
    "description":"Here will be your description. Use this to describe what you do or whatever you feel best describes yourself to a potential employer",
    "image":"images/profilepic.jpg",
    "bio":"Hi, I'm a the Full-Stack Web Developer mainily working with the PERN stack. I have worked with GraphQL and Prisma as well for a backend. I also have a B.S. degree from DeVry University in Game and Simulation Programming. While at DeVry I made video games and focused on them for mobile using Unreal and Unity game engines. I also Referee soccer games working up to Semi-Professional leagues around the Midwest. A fun fact was that in 2018 I was 1 of 24 Referees selected to represent the Midwest Region for the United States Youth Soccer Association's National Championship, in Dallas.",
    "email": "jagins629@gmail.com",
    "phone": "847-529-3100",
    "address":{
      "city":"Schaumburg",
      "state":"IL",
      "zip": "60194"
    },
    "website": "http://www.joshua-agins.com",
    "resumedownload":"https://resume.creddle.io/resume/57c23r5bprt",
    "social":[
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/joshua-agins/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"http://github.com/jagins",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"",
    "education":[
      {
        "school":"Lambda School",
        "degree":"Full-Stack Web Development",
        "graduated":"August 2020",
        "description":"Full-time 40 week full stack web development program that teaches front end and back end development using HTML5, CSS3, ES6 Javascript, React.js, Node.js, Express.js, RESTful API, Git, GitHub and computer science in Python including topics such as Object Oriented Programming (OOP), Algorithms, Data Structures, Hash Tables, Graphs and Computer Architecture"
      },
      {
        "school":"DeVry University - Addison",
        "degree":"Game and Simulation Programming",
        "graduated":"June 2013",
        "description":"Bacholor of Science program that teaches game design and game and simulation programing using C++/C# and DirectX. Worked with game engines such as Unreal3 and Unity and also creating a custom game engine from scratch. 3d modeling using 3D studio Max was also covered during the 127 credit hour cirriculum."
      }
    ],
    "work":[
      {
        "company":"NetherRealm Studios",
        "title":"Mobile QA Analyst ",
        "years":"June 2015 - June 2017",
        "description":"Worked on titles such as: Mortal Kombat X, WWE Immortals, Injustice: Gods Among Us, and Injustice2 on iOS and Android. Responsilbilites were to find and document bugs to the QA Lead, and in JIRA. Ensured high quality standards and intregrity of the product. Worked on a team of 7 other Mobile QA Analysts."
      },
      {
        "company":"WMS Gaming Inc",
        "title":"Test Engineer",
        "years":"October 2013 - March 2014",
        "description":"Worked on a project called Betcloud for Norwegian Cruise Lines. Responsiblities included: reporting and documenting bugs in the bug tracking software similar to JIRA and to the Project Manager and creating and executing test cases."
      }
    ],
    "skills":[
      {
        "name":"Git"
      },
      {
        "name":"Javascript"
      },
      {
        "name":"React"
      },
      {
        "name":"Node"
      },
      {
        "name":"HTML"
      },
      {
        "name":"CSS"
      },
      {
        "name":"LESS"
      },
      {
        "name":"PostGreSQL"
      },
      {
        "name":"Express"
      },
      {
        "name":"Redux"
      },
      {
        "name":"RESTful API"
      },
      {
        "name":"GraphQL"
      },
      {
        "name":"C#"
      },
      {
        "name":"C++"
      },
      {
        "name":"Prisma"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"images/portfolio/canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"images/portfolio/fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"images/portfolio/original-thai-food.jpg",
        "url":"http://www.timbakerdev.com/originalthaifood.github.io"
      }
    ]
  }
}
